export default {
  时段: "2023.05-2025.09",
  公司: "海信集团公司",
  职位: "前端开发工程师",
  技术栈: ["Vue", "HTML5", "CSS3", "TypeScript"],
  内容: `主要负责集团内技术基座之一————盘古低代码平台系统核心功能的前端开发工作，同时承担平台所支持开发的各业务项目组的技术支持工作，参与了盘古由2.0向3.0的升级。
	平台系统按前端代码划分为多个项目：
	PC端开发平台脚手架、PC端运行时脚手架、移动端脚手架、低代码页面引擎多包依赖项目等。
	具体工作包括：
	与产品确认需求边界，设计并完成开发详设文档，按照文档完成页面及交互逻辑实现、优化前端性能等；
	项目前端代码的重构与扩展；
	与后端同事紧密合作，完成后端数据交互和接口对接。`,
  业绩: `平均每月的系统可用率SLA一直保持在99.92%以上；
	系统开放使用初期，低代码页面引擎缺失很多功能或组件，该阶段中个人保持了每月完成15+功能补充需求或组件开发需求以及5+使用问题的需求，同时保证了对所负责业务项目组的技术支持；
	开发实现了数据建模功能和基于模型创建低代码页面的功能，使“根据数据表创建包含有简单增删改操作页面”成为现实，直接提升盘古流程中心生成流程表单页面效率（30%）
	在盘古原有数据权限基础上开发实现了多维度关联数据权限功能，打通了盘古数据模型与数据权限的多维度关联，提高了用户基于数据模型控制数据权限的灵活性；
	`,
};
