export default {
	时段: "2022.05-2023.05",
	公司: "东软集团（大连）有限公司",
	职位: "Java全栈工程师",
	技术栈: ["Java","JQuery","Hibernate","SpringMVC","SpringBoot","HTML5","CSS3","JavaScript"],
	内容: `负责集团人力资源相关的系统的核心业务的前端开发工作。
	上述系统包括：
	创吧招聘系统（后续正在开发 SaaS  化生态版创吧系统）、EHR  门户系统、组织系统、职业资格认证系统、HR  政策通、HR  头条、重大项目成果激励系统、人才盘点系统等。
	具体工作包括：
	与产品确认需求边界，完成页面及交互逻辑实现、优化前端性能等；
	项目前端代码的重构与完善；
	与后端同事紧密合作，完成后端数据交互和接口对接。`,
	业绩: `开发中找时间进行代码重构，提高前端代码的健壮性、可读性和可维护性，降低了后期维护、扩展的心智负担，改善了开发体验，从而提高了整体开发效率（10%）
	与产品确定需求边界后，以性能为主导确定页面设计和交互逻辑实现方案，对于旧页面提升体验和页面性能（20%）
	负责公司前端开发团队的管理和协调，提高了团队工作效率和写作能力
	年底获得公司优秀员工奖金奖励（部门5%）
	开发过程中积极探索前端技术和工具，提高了自己技术水平`
}